# Oval

## Description
Procedure Oval creates an oval object in a VectorWorks document.

```pascal
PROCEDURE Oval(
				p1X,p1Y : REAL;
				p2X,p2Y : REAL);
```

```python
def vs.Oval(p1, p2):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p1|REAL|Top left coordinate of oval bounding box.|
|p2|REAL|Bottom right coordinate of oval bounding box.|

## Version
Availability: from All Versions

## Category
* Objects - 2D